package com.ebeijia.robot.core.constant;

/**
 * 接口返回参数处理
 * @author lijm
 *
 */
public enum ApiResultCode{
	
	Success("0000","成功"),
	Err_0001("0001","失败"),
	Err_0002("0002","缺少参数"),
	Err_0003("0003","没有获取到验证码"),
	Err_0004("0004","验证码传入不正确或者过期"),
	Err_0005("0005","用户不存在"),
	Err_0006("0006","设备编码不存在"),
	Err_0007("0007","删除数据失败"),
	Err_0008("0008","上传文件格式不正确"),
	Err_0009("0009","无权限登陆"),
	Err_0010("0010","serKey失效"),
	Err_0011("0011","该资源已经绑定"),
	Err_0012("0012","不存在该设备信息"),
	Err_0013("0013","手机号码格式不正确"),
	Err_0014("0014","邮箱格式不正确"),
	Err_0015("0015","视频播放失败"),
	Err_0016("0016","输入学历长度过长"),
	Err_0017("0017","输入单位名称长度过长"),
	Err_0018("0018","输入单位职位长度过长"),
	Err_0019("0019","输入电话长度过长"),
	Err_0020("0020","用户ID已存在"),
	Err_1001("1001","用户名或密码错误"),
	Err_1002("1002","用户名已存在"),
	Err_1003("1003","用户Token失效"),
	Err_1004("1004","用户在其他设备上已登录"),
	Err_1005("1005","旧密码错误"),
	Err_1006("1006","含义非法字符"),
	Err_1007("1007","支付秘钥错误"),
	Err_1008("1008","非会员"),
	Err_1009("1009","会员过期"),
	Err_1010("1010","会员等级不够"),
	Err_2001("2001","文件不存在"),
	Err_2002("2002","不能传入默认token"),
	Err_2003("2003","输入专业长度过长"),
	Err_2004("2004","您存在未支付的订单信息"),
	Err_2005("2005","您的账号已被冻结，请联系管理员"),
	Err_3001("3001","签名错误"),
	Err_3002("3002","上载的附件不存在"),
	Err_9001("9001","系统繁忙");
	
	String code;
	String msg;
	
	ApiResultCode(String code,String msg) {
		this.code = code;
		this.msg = msg;
	}
	@Override
	public String toString() {
		return this.code;
	}
	
	public String getCode() {
		return code;
	}
	
	public String getMsg() {
		return msg;
	}		
	
}
